of-6/OpenFOAM-6-master/tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cyclicFacesFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.3015 0.0493 -1) (0.3069 0.2077 1);
        }
    }

    {
        name    cyclicFacesSlaveCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-1 0 -1) (0.305 0.31 1);
        }
    }

    {
        name    cyclicZoneFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet cyclicFacesFaceSet;
            cellSet cyclicFacesSlaveCells;
        }
    }
);

// ************************************************************************* //
